month = int(input("Введите номер месяц: "))
year_dict = {1: "зима",
             2: "зима",
             3: "весна",
             4: "весна",
             5: "весна",
             6: "лето",
             7: "лето",
             8: "лето",
             9: "осень",
             10: "осень",
             11: "осень",
             12: "зима"}

print(f"Месяц с номером {month} относится к времени года - {year_dict[month]}")

# решение через список
year_list = [[1, "зима"],
             [2, "зима"],
             [3, "весна"],
             [4, "весна"],
             [5, "весна"],
             [6, "лето"],
             [7, "лето"],
             [8, "лето"],
             [9, "осень"],
             [10, "осень"],
             [11, "осень"],
             [12, "зима"]]

for el in year_list:
    if el[0] == month:
        print(f"Месяц с номером {month} относится к времени года - {el[1]}")
        break
